Story.tex
% Created 2019-08-24 Sat 16:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Charilaos Skandylas}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Charilaos Skandylas},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}


\section*{Cellars 'n' Cantrips Pre-Alpha v0.01 Demo}
\label{sec:org8c72f58}
\subsection*{Act1: Introduction}
\label{sec:org12f5643}
You have recently arrived in the town of Rifthaven, filled with wonderlust, seeking a sense of purpose.
Over the first few days, nothing has been happening around town. Suddenly, yesterday, you heard a commotion
in the town center. While having your customary drink in the serpent's piss, the local tavern, you overheard some 
of the patrons discussing livestock and children of some of the farmers in the east end of town having been taken
by goblins. The next day you finally find a reward message in the town's message board: "Adventurers wanted!
Goblins have been ransacking the eastern farms, help eliminate the menace. Reward: 150 gold pieces for the
leader's head and 25 gold pieces for each rescued child or cattle. For more information please contact the mayor.
Act soon, lives are in danger!"  

\subsection*{Act2: The town}
\label{sec:org051c4f5}
Rifthaven is a small town, with a mostly citizen militia for its protection. 
The mayor Frank Baumeister is the most wealthy and prominent member of the community, 
with other notable members including, the blacksmith Sven Karlsson, the local alchemist Barlinda
and the  militia captain, Rufus.
\subsubsection*{The mayor}
\label{sec:org87ad70a}
Frank is a well spoken and traveled man, which is apparent by his apparel and stature.
He promises you the reward for the head of Gronkk(the goblin leader) and 25 gold pieces for each child or 
cattle that returns alive. If pressed he even adds 100 gold pieces of his own if all children are returned
safely.

\subsubsection*{Blacksmith}
\label{sec:org46db823}
The blacksmith can sell basic weapons and armor, but nothing too fancy.
Any item costing 200 or less gold is available. 
That includes, leather armor and bows he has acquired from a traveling salesman a few weeks ago.


\subsubsection*{Alchemist}
\label{sec:orge4e5ae5}
Barlinda can offer the hero(es) potions of healing and antidotes at a nominal fee, unfortunately,
she has not had enough time to prepare for such an event and the stocks are limited.

\subsubsection*{Militia}
\label{sec:orgfdbf014}
Rufus the local captain of the militia, an ex mercenary would love to be able to deal with the goblin menace.
The militia however is stretched very thin only consisting of a few young volunteers since the war with
the serpent empire took both the town's guard and best fighters away. He tells you that the goblins 
have probably occupied the old citadel used by the empire before its fall on the hills to the far east of town.

\subsection*{Act3: The old citadel on the hills}
\label{sec:orgc2fe549}
Following up on the rumors you arrive at the entrance of the citadel. Almost immediately, you hear screams and
soon thereafter see a few goblins scurrying to block your entry. Time to test your steel!

\subsubsection*{Quest 0: The Goblin Menace}
\label{sec:org9cd9cd1}
\subsubsection*{Slay Gronkk}
\label{sec:orgbdc615a}
\subsubsection*{Free the children}
\label{sec:orgd86ffb6}
\subsubsection*{Save the cattle}
\label{sec:org337dbb6}
\subsubsection*{Kill all goblins}
\label{sec:org9faad5c}


\subsection*{Act4: Ending}
\label{sec:org15d0f04}
With Gronkk and his goblins slain and the children and cattle safe the goblin menace is no more.
They mayor throws a feast in your name and hands you the key to the city. 
There might be hope for the people of the fallen empire after all!
You can not help but wonder however what pushed the goblins to be so aggressive and careless. 
How long can Rifthaven and the fallen empire endure with no organized government to protect and aid 
in a time of need ?
\end{document}